Table of Contents
 Interface IIdeaCut
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent cut operation
public interface IIdeaCut : IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 CutMethod
Cut Method
CutMethod CutMethod { get; }
Property Value
CutMethod
 CutOrientation
Cut Orientation
CutOrientation CutOrientation { get; }
Property Value
CutOrientation
 CutPart
Cut part
CutPart CutPart { get; }
Property Value
CutPart
 CuttingObject
Modified Object
IIdeaObject CuttingObject { get; }
Property Value
IIdeaObject
 DistanceComparison
Distance Comparison
DistanceComparison DistanceComparison { get; }
Property Value
DistanceComparison
 ModifiedObject
Modified Object
IIdeaObject ModifiedObject { get; }
Property Value
IIdeaObject
 Offset
Offset
double Offset { get; }
Property Value
double
 Weld
Weld of cut
IIdeaWeld Weld { get; }
Property Value
IIdeaWeld
 Edit this page